laroo/GateGuardian/src/esp32-swing-gate.ino.cpp
/**
 * ESP32 Swing Gate Controller
 * Main sketch file for controlling Sommer Twist 350 swing gate
 *
 * Features:
 * - Manual control via button
 * - MQTT remote control via Ethernet
 * - LED status indicators
 * - Gate position sensing
 * - Serial diagnostics at 115200 baud
 */

#include "Arduino.h"
#include <PubSubClient.h>
#include <arduino-timer.h>
#include <EthernetESP32.h>
// #include <WiFi.h>
#include <WebServer.h>
#include <ElegantOTA.h>
#include "DHT.h"
// #include "RemoteDebug.h"


// #include <PubSubClient.h>

#include "config.h"

#include "esp_system.h"
#include "esp32-hal-gpio.h"
#include "gate.h"
#include "ledmanager.h"
#include "mqttmanager.h"
#include <SPI.h>
#include <Network.h>
// #include <Debounce16.h>

EMACDriver driver(ETH_PHY_LAN8720, 23, 18, 16);   // note powerPin = 16 required
// EMACDriver driver(ETH_PHY_LAN8720, ETH_PHY_MDC, ETH_PHY_MDIO, ETH_PHY_POWER);
// EthernetClient   ethClient;

EthernetClient ethClient;
WiFiClient wifiClient;

// Pointer to the active client (Ethernet or WiFi)
NetworkClient* activeClient = nullptr;

// MQTT client - will be configured with activeClient dynamically
// PubSubClient mqttClient;

WebServer server(80);

// Connection check result (used by network event handler)
int connectionStatus = 0;

// DHTesp dhtSensor;
// config.sensor1Pin, DHTesp::DHT22

// #define DHTPIN 4
// #define DHTTYPE DHT22
// DHT dhtSensor(DHTPIN, DHTTYPE);

// RemoteDebug Debug;


// ============================================================================
// NETWORK EVENT HANDLER
// ============================================================================
// WARNING: This function is called from a separate FreeRTOS task (thread)!
void onNetworkEvent(arduino_event_id_t event, arduino_event_info_t info) {
  Serial.printf("[Network-event] event: %d\n", event);

  switch (event) {
    case ARDUINO_EVENT_ETH_START:
      Serial.println("[ETH] Ethernet started");
      break;
    case ARDUINO_EVENT_ETH_STOP:
      Serial.println("[ETH] Ethernet stopped");
      break;
    case ARDUINO_EVENT_ETH_CONNECTED:
      Serial.println("[ETH] Ethernet connected - Link UP");
      break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
      Serial.println("[ETH] Ethernet disconnected - Link DOWN");
      connectionStatus = 0;
      activeClient = nullptr;
      break;
    case ARDUINO_EVENT_ETH_GOT_IP:
      Serial.print("[ETH] Obtained IP address: ");
      Serial.println(IPAddress(info.got_ip.ip_info.ip.addr));
      Serial.print("[ETH] Gateway: ");
      Serial.println(IPAddress(info.got_ip.ip_info.gw.addr));
      Serial.print("[ETH] Netmask: ");
      Serial.println(IPAddress(info.got_ip.ip_info.netmask.addr));
      connectionStatus = 1;
      activeClient = &ethClient;
      break;
    case ARDUINO_EVENT_ETH_GOT_IP6:
      Serial.println("[ETH] Ethernet IPv6 is preferred");
      break;
    case ARDUINO_EVENT_WIFI_STA_START:
      Serial.println("[WiFi] WiFi client started");
      break;
    case ARDUINO_EVENT_WIFI_STA_STOP:
      Serial.println("[WiFi] WiFi client stopped");
      break;
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
      Serial.println("[WiFi] Connected to access point");
      break;
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      Serial.println("[WiFi] Disconnected from WiFi access point");
      if (connectionStatus == 2) {
        connectionStatus = 0;
        activeClient = nullptr;
      }
      break;
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      Serial.print("[WiFi] Obtained IP address: ");
      Serial.println(IPAddress(info.got_ip.ip_info.ip.addr));
      connectionStatus = 2;
      activeClient = &wifiClient;
      break;
    case ARDUINO_EVENT_WIFI_STA_LOST_IP:
      Serial.println("[WiFi] Lost IP address");
      if (connectionStatus == 2) {
        connectionStatus = 0;
        activeClient = nullptr;
      }
      break;
    default:
      break;
  }
}

// ============================================================================
// CONFIGURATION STRUCTURE
// ============================================================================
struct Config {
  char clientId[32]; // Random client ID generated at startup
  // char statusTopic[64] = "gateguardian/status";
  // char commandTopic[64] = "gateguardian/command";

  // Timing Settings
  unsigned long gateOperationTime = 20000; // 20 seconds (Requirement 2)
  unsigned long relayPulseTime = 500;      // 500ms (Requirement 1)
  unsigned long publishInterval = 10000;   // 10 seconds (Requirement 7)
  unsigned long blinkInterval = 500;       // 500ms (Requirement 3)
  unsigned long debounceTime = 50;         // 50ms button debounce

  // GPIO Pins
  int redLedPin = 17;
  int greenLedPin = 5;

  int gateLightsPin = 33;
  int gateLockPin = 32;
  int externalRelayPin = 35;  // Input only
  int photoEyePin = 36;  // Input only

  int sensor1Pin = 4;
  int sensor2Pin = 2;

  int openRelayPin = 15;
  int closeRelayPin = 12;
  int stopRelayPin = 14;

};

// ============================================================================
// GLOBAL VARIABLES
// ============================================================================
Config config;
Gate *gate = nullptr;
LEDManager *ledManager = nullptr;
MQTTManager *mqttManager = nullptr;

// Timer for main loop management
auto mainTimer = timer_create_default();

// Previous gate state for change detection
GateState previousGateState = GATE_UNKNOWN;

// Button handling variables
bool lastButtonState = LOW; // Button is active LOW with pull-up
bool currentButtonState = HIGH;
unsigned long lastButtonChange = 0;
bool buttonPressed = false; // Flag to track button press events

// Debounce16 gateLightsButton(config.gateLightsPin, LOW);
// Debounce16 gateLockButton(config.gateLockPin, LOW);
// Debounce16 externalRelayButton(config.externalRelayPin, LOW);
// Debounce16 photoEyeButton(config.photoEyePin, LOW);


// ============================================================================
// FUNCTION DECLARATIONS
// ============================================================================
void initializeGPIO();
void handleBootDelay();
// void handleButtonInput();
void printConfigSummary();
int checkConnection();
bool checkConnectionCallback(void *);
bool reportConnectionStatusCallback(void *);
// bool checkInputCallback(void *);
NetworkClient* getActiveClient();

void onButtonPress() {
    Serial.println("!!!!!!! Button pressed!");
}

void onButtonRelease() {
    Serial.println("!!!!!!! Button released!");
}

