laroo/GateGuardian/src/esp32-swing-gate.ino.cpp
// void mqttCallback(char* topic, byte* payload, unsigned int length) {
//   Serial.print("Message arrived [");
//   Serial.print(topic);
//   Serial.print("] ");
//   for (int i=0;i<length;i++) {
//     Serial.print((char)payload[i]);
//   }
//   Serial.println();
// }

// void mqttReconnect() {
//   // Loop until we're reconnected
//   while (!mqttClient.connected()) {
//     Serial.print("Attempting MQTT connection...");
//     // Attempt to connect
//     if (mqttClient.connect("arduinoClient")) {
//       Serial.println("connected");
//       // Once connected, publish an announcement...
//       mqttClient.publish("outTopic","hello world");
//       // ... and resubscribe
//       mqttClient.subscribe("inTopic");
//     } else {
//       Serial.print("failed, rc=");
//       Serial.print(mqttClient.state());
//       Serial.println(" try again in 5 seconds");
//       // Wait 5 seconds before retrying
//       delay(5000);
//     }
//   }
// }

// ============================================================================
// SETUP FUNCTION
// ============================================================================
void setup() {

  // Boot delay for power outage safety (Requirement 8)
  handleBootDelay();

  // Initialize GPIO pins (Requirement 5.1)
  initializeGPIO();

  // Initialize serial communication at 115200 baud (Requirement 4.1)
  Serial.begin(115200);
  delay(100); // Allow serial to initialize

  // Print initialization messages (Requirement 4.1)
  Serial.println("[INIT] ESP32 Gate Controller v1.0 starting...");
  Serial.print("[INIT] Free heap: ");
  Serial.print(ESP.getFreeHeap());
  Serial.println(" bytes");
  
  // dhtSensor.begin();
  // float temperature = dhtSensor.readTemperature();
  // float humidity = dhtSensor.readHumidity();
  // Serial.println("Temp:     " + String(temperature, 2) + "°C");
  // Serial.println("Humidity: " + String(humidity, 1) + "%");

  // Generate random client ID for MQTT
  randomSeed(analogRead(0));
  sprintf(config.clientId, "esp32_gate_%06X", random(0xFFFFFF));
  Serial.print("[INIT] MQTT Client ID: ");
  Serial.println(config.clientId);

  // Debug.begin(config.clientId);    // Initialize the WiFi server
  // Debug.setResetCmdEnabled(true);  // Enable the reset command
  // Debug.showProfiler(false);        // Profiler (Good to measure times, to optimize codes)
  // Debug.showColors(true);          // Colors
  // Serial.println("[RemoteDebug] Initialized");


  // gateLightsButton.onPress(onButtonPress);
  // gateLightsButton.onRelease(onButtonRelease);

  // gateLockButton.onPress(onButtonPress);
  // gateLockButton.onRelease(onButtonRelease);

  // externalRelayButton.onPress(onButtonPress);
  // externalRelayButton.onRelease(onButtonRelease);

  // photoEyeButton.onPress(onButtonPress);
  // photoEyeButton.onRelease(onButtonRelease);

  
  // Initialize button state after GPIO configuration
  // lastButtonState = digitalRead(config.buttonPin);
  // currentButtonState = lastButtonState;
  // Serial.print("[INIT] Initial button state: ");
  // Serial.println(lastButtonState ? "HIGH (not pressed)" : "LOW (pressed)");

  // Initialize Gate controller
  gate = new Gate();
  if (gate) {
    gate->initialize();
    Serial.println("[INIT] Gate controller created and initialized");
  } else {
    Serial.println("[ERROR] Failed to create Gate controller");
  }

  // Initialize LED Manager
  ledManager = new LEDManager(config.redLedPin, config.greenLedPin);
  if (ledManager) {
    ledManager->initialize();

    // Set initial LED state based on gate state
    if (gate) {
      GateState initialState = gate->getState();
      ledManager->setStatus(initialState);
      previousGateState = initialState;
    }

    Serial.println("[INIT] LED manager initialized");
  } else {
    Serial.println("[ERROR] Failed to initialize LED manager");
  }


  // mqttClient.setServer(config.mqttBroker, config.mqttPort);
  // mqttClient.setCallback(mqttCallback);


  // Register network event listener
  Network.onEvent(onNetworkEvent);
  Serial.println("[INIT] Network event listener registered");

  Ethernet.init(driver);

  Serial.print("Link 1: ");
  Serial.println(Ethernet.linkStatus()); //Prints 2 = LinkOFF, as expected


  Serial.println("Initialize Ethernet with DHCP:");
  if (Ethernet.begin()) {
    Serial.print("  DHCP assigned IP ");
    Serial.println(Ethernet.localIP());
  } else {
    Serial.println("Failed to configure Ethernet using DHCP");
    // while (true) {
    //   delay(1);
    // }
  }

  Serial.print("Link 2: ");
  Serial.println(Ethernet.linkStatus()); //prints 1 = LinkON, even with no cable plugged in

  // Check for Ethernet hardware present
  if (Ethernet.hardwareStatus() == EthernetNoHardware) {
    Serial.println("Ethernet shield was not found.  Sorry, can't run without hardware. :(");
    // while (true) {
    //   delay(1); // do nothing, no point running without Ethernet hardware
    // }
  }
  if (Ethernet.linkStatus() == LinkOFF) {
    //This statement should print but doesn't when I test with no cable
    Serial.println("Ethernet cable is not connected.");
  }

  // if (MDNS.begin("gateguardian")) {
  //   Serial.println("MDNS responder started");
  // }

  // Initialize MQTT Manager (Requirements 7.1, 7.2)
  mqttManager = new MQTTManager(MQTT_BROKER, MQTT_PORT, 
                                config.clientId, MQTT_TOPIC_STATUS, 
                                MQTT_TOPIC_COMMAND, MQTT_USERNAME, MQTT_PASSWORD);
  if (mqttManager) {
    mqttManager->initialize(activeClient);
    
    // Set gate controller reference for command handling
    if (gate) {
      mqttManager->setGateController(gate);
    }
    
    Serial.println("[INIT] MQTT manager initialized");
  } else {
    Serial.println("[ERROR] Failed to initialize MQTT manager");
  }


  server.on("/", []() {
    server.send(200, "text/plain", "Hi! This is GateGuardian");
  });
  server.on("/gate/close", []() {
    gate->closeGate();
    server.send(200, "text/plain", "Gate closing...");
  });
  server.on("/gate/open", []() {
    gate->openGate();
    server.send(200, "text/plain", "Gate opening...");
  });
  server.on("/gate/stop", []() {
    gate->stopGate();
    server.send(200, "text/plain", "Gate stopping...");
  });
  // server.on("/gate/toggle", []() {
  //   gate->toggle();
  //   server.send(200, "text/plain", "Gate toggling...");
  // });
  
  // server.on("/gate/stop", []() {
  //   gate->stop();
  //   server.send(200, "text/plain", "Gate stopping...");
  // });
  ElegantOTA.begin(&server);
  server.begin();
  Serial.println("HTTP server started");

  // Print configuration summary
  printConfigSummary();

