laroo/GateGuardian/src/esp32-swing-gate.ino.cpp
  // Schedule checkConnection to run every 1000ms (1 second)
  mainTimer.every(5000, checkConnectionCallback);
  Serial.println("[INIT] Connection check scheduled every 1 second");

  // Schedule input to run every 1000ms
  // mainTimer.every(10000, checkInputCallback);
  // Serial.println("[INIT] input check scheduled every 1 second");


  // Schedule connection status reporting every 2000ms (2 seconds)
  mainTimer.every(5000, reportConnectionStatusCallback);
  Serial.println("[INIT] Connection status reporting scheduled every 2 seconds");

  Serial.println("[INIT] System initialization complete");
  Serial.println("======================================");
}

// Timer callback for connection checking
bool checkConnectionCallback(void *) {
  connectionStatus = checkConnection();
  return true; // Repeat the timer
}

// Timer callback for reporting connection status
bool reportConnectionStatusCallback(void *) {
  if (connectionStatus == 1) {
    Serial.println("Connected to Ethernet");
  }
  else if (connectionStatus == 2) {
    Serial.println("Connected to Wi-Fi");
  }
  else {
    Serial.println("Not Connected");
  }
  return true; // Repeat the timer
}

int checkConnection() {
  // Check if Ethernet is available
  if(ethClient.connected() && (Ethernet.linkStatus() == LinkON)) {
    Serial.println("Existing Ethernet connection");
    activeClient = &ethClient;
    return 1;
  }
  else if (Ethernet.linkStatus() == LinkON) {
    // Use Ethernet connection
    Serial.println("Ethernet LINKON");
    if (!ethClient.connected()) {
      Serial.println("Connecting via Ethernet...");
        // beginMicros = micros();
        WiFi.disconnect();
        //delay(5000);
        activeClient = &ethClient;
        return 1;
    }
  }
  // else{
  //   Serial.println("Not Successfull Ethernet Connection");
  // }

 if (WiFi.status() == WL_CONNECTED) {
    Serial.println("Existing Wi-Fi connection");
    activeClient = &wifiClient;
    return 2;
  }

  // Use Wi-Fi connection
  WiFi.begin("Wokwi-GUEST", "", 6);
  Serial.println("Connecting via Wi-Fi...");
  for (int i = 0; i < 50; i++) {
    if ((WiFi.status() == WL_CONNECTED))
      Serial.println(" CONNECTED");
      break;
    delay(100);
    Serial.print(".");
  }

  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("Connected to Wi-Fi ");
    // Serial.println(WiFi.localIP());
    // Additional Wi-Fi initialization if needed
    activeClient = &wifiClient;
    return 2;
  }
  else{
    Serial.println("Wi-Fi not Connected");
  }

  activeClient = nullptr;
  return 0;
}

// ============================================================================
// MAIN LOOP
// ============================================================================
void loop() {

    static unsigned long lastUpdate = 0;

    // Update button state every 1ms
    if (millis() - lastUpdate >= 1) {
        lastUpdate = millis();
        // gateLightsButton.update();
        // gateLockButton.update();
        // externalRelayButton.update();
        // photoEyeButton.update();    
    }



  // Connection status is now reported by timer callback every 2 seconds
  if (activeClient && connectionStatus > 0) {

    // static unsigned long lastNetworkUpdate = 0;
    // if (millis() - lastNetworkUpdate >= 500) {
    //     lastNetworkUpdate = millis(); 
    //     Serial.println("Active Network Loop!");
    // }

    server.handleClient();
    ElegantOTA.loop();

    // Update MQTT manager (Requirements 7.1, 7.2, 7.3, 7.4)
    if (mqttManager) {
      mqttManager->setClient(activeClient);
      mqttManager->update();
    }
    // Debug.handle();

    // mqttClient.setClient(*activeClient);
    // if (!mqttClient.connected()) {
    //   mqttReconnect();
    // }
    // mqttClient.loop();
  }

  unsigned long loopStart = millis();

  // Handle button input with debouncing
  // handleButtonInput();

  // Update gate controller
  if (gate) {
    gate->update();

    // Check for gate state changes and update LEDs
    GateState currentState = gate->getState();
    if (currentState != previousGateState) {
      if (ledManager) {
        ledManager->setStatus(currentState);
      }
      previousGateState = currentState;
    }
  }

  // Update LED manager
  if (ledManager) {
    ledManager->update();
  }

  // Tick main timer for any scheduled tasks
  mainTimer.tick();

  // Calculate loop execution time
  unsigned long loopTime = millis() - loopStart;

  // Ensure loop completes within 1 second (Requirement 5.2)
  if (loopTime > 1000) {
    Serial.print("[WARNING] Loop execution time exceeded 1 second: ");
    Serial.print(loopTime);
    Serial.println("ms");
  }

  // Small delay to prevent excessive CPU usage
  delay(10);
}

// ============================================================================
// BOOT DELAY (Requirement 8)
// ============================================================================
void handleBootDelay() {
  // Only run boot delay on power-on reset, not after software reset
  esp_reset_reason_t reason = esp_reset_reason();
  if (reason == ESP_RST_SW) {
    // This is the clean reboot after boot delay — skip
    Serial.begin(115200);
    delay(100);
    Serial.println("[BOOT] Software reset detected, skipping boot delay");
    return;
  }

  // Force relay pins LOW immediately to prevent spurious signals
  pinMode(config.openRelayPin, OUTPUT);
  pinMode(config.closeRelayPin, OUTPUT);
  pinMode(config.stopRelayPin, OUTPUT);
  digitalWrite(config.openRelayPin, LOW);
  digitalWrite(config.closeRelayPin, LOW);
  digitalWrite(config.stopRelayPin, LOW);

  // Initialize LEDs for boot delay indication
  pinMode(config.redLedPin, OUTPUT);
  pinMode(config.greenLedPin, OUTPUT);

  Serial.begin(115200);
  delay(100);
  Serial.println("[BOOT] Power-on detected, starting boot delay...");
  Serial.print("[BOOT] Waiting ");
  Serial.print(BOOT_DELAY_MS / 1000);
  Serial.println(" seconds for Sommer Twist 350 to initialize");

  unsigned long startTime = millis();
  unsigned long remaining = BOOT_DELAY_MS;
  int lastSecond = -1;
  bool ledState = false;

