laroo/GateGuardian/src/esp32-swing-gate.ino.cpp
  while (remaining > 0) {
    unsigned long elapsed = millis() - startTime;
    remaining = (elapsed >= BOOT_DELAY_MS) ? 0 : (BOOT_DELAY_MS - elapsed);
    int currentSecond = remaining / 1000;

    // Print countdown once per second
    if (currentSecond != lastSecond) {
      lastSecond = currentSecond;
      Serial.print("[BOOT] Countdown: ");
      Serial.print(currentSecond + 1);
      Serial.println("s remaining");
    }

    // Blink both LEDs together (250ms on/off) as boot-delay indicator
    ledState = (millis() / 250) % 2 == 0;
    digitalWrite(config.redLedPin, ledState ? HIGH : LOW);
    digitalWrite(config.greenLedPin, ledState ? HIGH : LOW);

    // Keep relay pins forced LOW during delay
    digitalWrite(config.openRelayPin, LOW);
    digitalWrite(config.closeRelayPin, LOW);
    digitalWrite(config.stopRelayPin, LOW);

    delay(10);
  }

  // Turn LEDs off before restart
  digitalWrite(config.redLedPin, LOW);
  digitalWrite(config.greenLedPin, LOW);

  Serial.println("[BOOT] Boot delay complete, performing software reset...");
  Serial.flush();
  delay(100);
  ESP.restart();
}

// ============================================================================
// GPIO INITIALIZATION
// ============================================================================
void initializeGPIO() {

  // Configure LED outputs
  pinMode(config.redLedPin, OUTPUT);
  pinMode(config.greenLedPin, OUTPUT);
  digitalWrite(config.redLedPin, LOW);
  digitalWrite(config.greenLedPin, LOW);

  // Configure relay outputs
  pinMode(config.openRelayPin, OUTPUT);
  pinMode(config.closeRelayPin, OUTPUT);
  pinMode(config.stopRelayPin, OUTPUT);
  digitalWrite(config.openRelayPin, LOW);
  digitalWrite(config.closeRelayPin, LOW);
  digitalWrite(config.stopRelayPin, LOW);
  
  // Configure sensor input with internal pull-up  
  pinMode(config.gateLightsPin, INPUT_PULLUP);
  pinMode(config.gateLockPin, INPUT_PULLUP);
  pinMode(config.externalRelayPin, INPUT);
  pinMode(config.photoEyePin, INPUT);

  // Configure sensor input with internal pull-up
  pinMode(config.sensor1Pin, INPUT);
  pinMode(config.sensor2Pin, INPUT);
  
}

// ============================================================================
// BUTTON INPUT HANDLING
// ============================================================================
// void handleButtonInput() {
//   currentButtonState = digitalRead(config.buttonPin);
//   unsigned long currentTime = millis();

//   // Debug: Log button state changes (remove this in production)
//   static unsigned long lastDebugTime = 0;
//   if (currentTime - lastDebugTime > 500) { // Every 5 seconds
//     Serial.print("[DEBUG] Button state: ");
//     Serial.print(currentButtonState ? "HIGH" : "LOW");
//     Serial.print(", Gate state: ");
//     if (gate) {
//       Serial.println(gate->getStateString());
//     } else {
//       Serial.println("NULL");
//     }
//     lastDebugTime = currentTime;
//   }

//   // Check if button state changed and debounce time has passed
//   // (Requirement 1.3, 4.3, 5.3)
//   if (currentButtonState != lastButtonState &&
//       (currentTime - lastButtonChange) >= config.debounceTime) {

//     lastButtonChange = currentTime;
//     lastButtonState = currentButtonState;

//     Serial.print("[BUTTON] Button state changed to: ");
//     Serial.println(currentButtonState ? "HIGH (released)" : "LOW (pressed)");

//     // Button pressed (LOW due to pull-up resistor)
//     if (currentButtonState == LOW) {
//       buttonPressed = true;
//       Serial.println("[BUTTON] Button pressed - debounced");

//       // Check if gate is available and not during relay activation
//       // (Requirements 1.1, 1.2, 4.3)
//       if (gate) {
//         // Prevent button actions during relay activation periods
//         if (gate->isRelayActive()) {
//           Serial.println("[BUTTON] Relay is active, button action ignored");
//         } else if (gate->isMoving()) {
//           Serial.println("[BUTTON] Gate is moving, button action ignored");
//         } else {
//           Serial.println("[BUTTON] Triggering gate toggle");
//           gate->toggle();
//         }
//       } else {
//         Serial.println("[ERROR] Gate controller not available");
//       }
//     } else {
//       // Button released (HIGH due to pull-up resistor)
//       if (buttonPressed) {
//         buttonPressed = false;
//         Serial.println("[BUTTON] Button released - debounced");
//       }
//     }
//   }
// }

// ============================================================================
// CONFIGURATION SUMMARY
// ============================================================================
void printConfigSummary() {
  Serial.println("[CONFIG] System Configuration:");
  // Serial.print("  MQTT Broker: ");
  // Serial.print(config.mqttBroker);
  // Serial.print(":");
  // Serial.println(config.mqttPort);
  // Serial.print("  Client ID: ");
  // Serial.println(config.clientId);
  // Serial.print("  Status Topic: ");
  // Serial.println(config.statusTopic);
  // Serial.print("  Command Topic: ");
  // Serial.println(config.commandTopic);
  Serial.print("  Gate Operation Time: ");
  Serial.print(config.gateOperationTime);
  Serial.println("ms");
  Serial.print("  Relay Pulse Time: ");
  Serial.print(config.relayPulseTime);
  Serial.println("ms");
  Serial.print("  Publish Interval: ");
  Serial.print(config.publishInterval);
  Serial.println("ms");
}

// ============================================================================
// GET ACTIVE CLIENT
// ============================================================================
/**
 * Returns a pointer to the active network client (Ethernet or WiFi)
 * based on the current connection status.
 * 
 * @return NetworkClient* Pointer to active client, or nullptr if no connection
 */
NetworkClient* getActiveClient() {
  return activeClient;
}
